---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelEndAlignmentMethod
source: html/d853a0e2-06a1-dd79-491f-d37147c984e6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelEndAlignmentMethod Property

"End Alignment Method"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelEndAlignmentMethod { get; }
```